// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "有我在<br />这不会是最糟糕的生日！",
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "最棒的佳叶同学",  // 同上...
        "今天是陪你过生日的开端",
        "往后都会一起进入生日的轮回",
        "往后的每一天我都会在你身边",
        "相处的时间虽短<br />相遇的时间却很巧<br />",
        "车马很慢<br />书信很远<br />遇见你很好",
        "喜欢高冷的你",
        "喜欢甜甜的你",
        "喜欢美美的你",
        "喜欢五彩斑斓的你",
        "喜欢满腹才华的你",
        "喜欢天赋异禀的你",
        "最幸福的是<br />我们都在慢慢变得更好",
        "而我<br />更是<br />一直被佳叶同学感动着",
        "感谢佳叶同学的保护与陪伴",
        "感谢佳叶老师的指导",
        "感谢佳叶老师的教导",
        "剩下的路跟我一起走",
        "不知道这么优秀的小笨蛋<br />愿不愿意",
        "最后<br />我的小笨蛋<br />生日快乐~~",
        "--每天都想娶你回家的欧阳老师",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "送给我": "./imgs/songxinxin.jpeg",
        "最棒的佳叶同学": "./imgs/pig.jpg",
        "今天是陪你过生日的开端": "./imgs/cake1.jpg",
        "往后都会一起进入生日的轮回": "./imgs/cake2.jpg",
        "往后的每一天我都会在你身边": "./imgs/day.jpg",
        "喜欢高冷的你": "./imgs/mystery.jpg",
        "喜欢甜甜的你": "./imgs/fighting.jpg",
        "喜欢美美的你": "./imgs/princess.jpg",
        "喜欢五彩斑斓的你": "./imgs/romantic.jpg",
        "喜欢满腹才华的你": "./imgs/painter.jpg",
        "喜欢天赋异禀的你": "./imgs/master.jpg",
        "感谢佳叶同学的保护与陪伴": "./imgs/honor.jpg",
        "感谢佳叶老师的指导": "./imgs/dish.jpg",
        "感谢佳叶老师的教导": "./imgs/chat.jpg",
        "剩下的路跟我一起走": "./imgs/hands.jpg",
        "这么优秀的小笨蛋<br />你愿意吗": "./imgs/flower.jpg",
        "最后<br />我的小笨蛋<br />生日快乐~~": "./imgs/cake1.jpg",
    },
    
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "放心，今天不打你PP",
        play: "我们，先来首甜甜的音乐",
        bannar_coming: "给你球球",
        balloons_flying: "球球不够，多点再多点",
        cake_fadein:"小笨蛋，你敢点我嘛☺",
        light_candle:"小笨蛋，你敢再点我嘛(^.^)Y Ya!!",
        wish_message: "哈哈，恭喜小天才通过考验！",
        story: "JiaYeTongXue Happy Birthday~~"
    },

    // 结束语
    loveText: 'jiayetongye yyds！！！'
};
